[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.js:121:43
               id="requestTime"
               type="text"
               isInvalid={Boolean(errors.requestTime)}
-              {...register("requestTime", {
-                required: "Request Time is required",
-                pattern: {
-                  value: isoDate_regex,
-                  message: "Please enter a valid request time.",
-                },
-              })}
+              {...register("requestTime", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests Correct Error messages on bad input
statusReason: Error: Unable to find an element with the text: /Please enter a valid request time/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.js:165:28
               data-testid="HelpRequestForm-solved"
               id="solved"
               type="checkbox"
-              {...register("solved", {
+              {...register("", {
                 required: "Solved status is required.",
               })}
killedBy: HelpRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.js:166:27
               id="solved"
               type="checkbox"
               {...register("solved", {
-                required: "Solved status is required.",
+                required: "",
               })}
             />
killedBy: HelpRequestForm tests Correct Error messages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Solved status is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
