[Killed] BooleanLiteral
main/components/Articles/ArticlesForm.js:119:27
               type="text"
               isInvalid={Boolean(errors.email)}
               {...register("email", {
-                required: true,
+                required: false,
                 pattern: email_regex,
               })}
killedBy: ArticlesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.js:125:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.email && "Email is required."}
-              {errors.email?.type === "pattern" &&
-                "Email must be in the format username@domain.extension"}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: ArticlesForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Email must be in the format username@domain.extension/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/Articles/ArticlesForm.js:125:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.email && "Email is required."}
-              {errors.email?.type === "pattern" &&
+              {errors.email.type === "pattern" &&
                 "Email must be in the format username@domain.extension"}
             </Form.Control.Feedback>
killedBy: ArticlesForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'type')
