[Killed] BlockStatement
main/pages/Articles/ArticlesCreatePage.js:37:32
     mutation.mutate(data);
   };
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/Articles" />;
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: ArticlesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/Articles"}

Number of calls: 0
