[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:28:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialContents && (
-        <Row>
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">ID</Form.Label>
-              <Form.Control
-                data-testid="HelpRequestForm-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        </Row>
-      )}
+      {false}
 
       <Row>
killedBy: HelpRequestForm tests renders correctly when passing in a HelpRequest
statusReason: Error: Unable to find an element by: [data-testid="/HelpRequestForm-id/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/HelpRequest/HelpRequestForm.js:28:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialContents && (
-        <Row>
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">ID</Form.Label>
-              <Form.Control
-                data-testid="HelpRequestForm-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        </Row>
-      )}
+      {initialContents || <Row>
+          <Col>
+            <Form.Group className="mb-3">
+              <Form.Label htmlFor="id">ID</Form.Label>
+              <Form.Control data-testid="HelpRequestForm-id" id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+            </Form.Group>
+          </Col>
+        </Row>}
 
       <Row>
killedBy: HelpRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.js:79:50
               id="teamId"
               type="text"
               isInvalid={Boolean(errors.teamId)}
-              {...register("teamId", { required: "Team ID is required." })}
+              {...register("teamId", { required: "" })}
             />
             <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests Correct Error messages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Team ID is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.js:121:43
               id="requestTime"
               type="datetime-local"
               isInvalid={Boolean(errors.requestTime)}
-              {...register("requestTime", {
-                required: true,
-                pattern: isoDate_regex,
-              })}
+              {...register("requestTime", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests Correct Error messages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Request Time is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.js:162:28
               data-testid="HelpRequestForm-solved"
               id="solved"
               type="checkbox"
-              {...register("solved")}
+              {...register("")}
             />
           </Form.Group>
killedBy: HelpRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')
