[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestTable.js:34:5
   };
 
   const columns = [
-    {
-      Header: "ID",
-      accessor: "id", // accessor is the "key" in the data
-    },
+    {},
     {
       Header: "Requester Email",
killedBy: HelpRequestTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!
