[Killed] StringLiteral
main/pages/HelpRequest/HelpRequestCreatePage.js:23:7
 
   const onSuccess = (helpRequest) => {
     toast(
-      `New HelpRequest Created - id: ${helpRequest.id} requesterEmail: ${helpRequest.requesterEmail}`,
+      ``,
     );
   };
killedBy: HelpRequestCreatePage tests on submit, makes request to backend, and redirects to /helprequest
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New HelpRequest Created - id: 5 requesterEmail: student1@example.com"
Received: ""

Number of calls: 1
