[Killed] BlockStatement
main/pages/MenuItemReview/MenuItemReviewCreatePage.js:20:41
     },
   });
 
-  const onSuccess = (menuItemReview) => {
-    toast(`New menuItemReview Created - id: ${menuItemReview.id} itemId: ${menuItemReview.itemId}`);
-  };
+  const onSuccess = (menuItemReview) => {};
 
   const mutation = useBackendMutation(
killedBy: MenuItemReviewCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New menuItemReview Created - id: 17 itemId: 4"

Number of calls: 0
