[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:29:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">ID</Form.Label>
-              <Form.Control
-                data-testid="HelpRequestForm-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {false}
 
         <Col>
killedBy: HelpRequestForm tests renders correctly when passing in a HelpRequest
statusReason: Error: Unable to find an element by: [data-testid="/HelpRequestForm-id/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:29:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">ID</Form.Label>
-              <Form.Control
-                data-testid="HelpRequestForm-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {true}
 
         <Col>
killedBy: HelpRequestForm tests renders correctly when passing in a HelpRequest
statusReason: Error: Unable to find an element by: [data-testid="/HelpRequestForm-id/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.js:55:26
               isInvalid={Boolean(errors.requesterEmail)}
               {...register("requesterEmail", {
                 required: "Requester Email is required.",
-                pattern: {
-                  value: email_regex,
-                  message: "Please enter a valid email address.",
-                },
+                pattern: {},
               })}
             />
killedBy: HelpRequestForm tests Correct Error messages on bad input
statusReason: Error: Unable to find an element with the text: /Please enter a valid email address/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.js:57:28
                 required: "Requester Email is required.",
                 pattern: {
                   value: email_regex,
-                  message: "Please enter a valid email address.",
+                  message: "",
                 },
               })}
killedBy: HelpRequestForm tests Correct Error messages on bad input
statusReason: Error: Unable to find an element with the text: /Please enter a valid email address/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.js:114:27
               type="text"
               isInvalid={Boolean(errors.requestTime)}
               {...register("requestTime", {
-                required: "Request Time is required",
+                required: "",
                 pattern: {
                   value: isoDate_regex,
killedBy: HelpRequestForm tests Correct Error messages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Request Time is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.js:115:26
               isInvalid={Boolean(errors.requestTime)}
               {...register("requestTime", {
                 required: "Request Time is required",
-                pattern: {
-                  value: isoDate_regex,
-                  message: "Please enter a valid request time.",
-                },
+                pattern: {},
               })}
             />
killedBy: HelpRequestForm tests Correct Error messages on bad input
statusReason: Error: Unable to find an element with the text: /Please enter a valid request time/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.js:117:28
                 required: "Request Time is required",
                 pattern: {
                   value: isoDate_regex,
-                  message: "Please enter a valid request time.",
+                  message: "",
                 },
               })}
killedBy: HelpRequestForm tests Correct Error messages on bad input
statusReason: Error: Unable to find an element with the text: /Please enter a valid request time/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.js:153:38
               data-testid="HelpRequestForm-solved"
               id="solved"
               type="checkbox"
-              {...register("solved", {
-                required: "Solved status is required.",
-              })}
+              {...register("solved", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests Correct Error messages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Solved status is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
