[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:61:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.itemId && "ItemId is required. "}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /ItemId is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.js:61:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.itemId && "ItemId is required. "}
+              {errors.itemId || "ItemId is required. "}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /ReviewerEmail is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:137:27
               type="text"
               isInvalid={Boolean(errors.comments)}
               {...register("comments", {
-                required: "Comments are required.",
+                required: "",
               })}
             />
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Comments are required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
