[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:85:35
           id="station"
           type="text"
           isInvalid={Boolean(errors.station)}
-          {...register("station", {
-            required: "Station is required.",
-            maxLength: {
-              value: 50,
-              message: "Max length is 50 characters",
-            },
-          })}
+          {...register("station", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: UCSBDiningCommonsMenuItemForm tests shows validation errors when fields are empty
statusReason: Error: Unable to find an element with the text: /Station is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
